# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [18]:
s1=np.random.randint(1,5,size=100)
s2=np.random.randint(1,4,size=100)
s3=np.random.randint(10000,30001,size=100)

### Step 3. Let's create a DataFrame by joinning the Series by column

In [20]:
df=pd.DataFrame([s1,s2,s3],).T
df

    0  1      2
0   3  3  13861
1   4  2  15072
2   3  1  19514
3   1  2  13091
4   1  2  16080
.. .. ..    ...
95  1  2  22185
96  4  2  28107
97  1  3  19900
98  3  3  18082
99  4  1  17247

[100 rows x 3 columns]

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [21]:
df2=df.rename(columns={0: 'beds', 1: 'baths', 2: 'price_sqr_meter'}) # para renombrar usamos .rename (columns={'nombre columna antigua':'nombre columna nueva'}
df2

    beds  baths  price_sqr_meter
0      3      3            13861
1      4      2            15072
2      3      1            19514
3      1      2            13091
4      1      2            16080
..   ...    ...              ...
95     1      2            22185
96     4      2            28107
97     1      3            19900
98     3      3            18082
99     4      1            17247

[100 rows x 3 columns]

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [28]:
bigcolumn=np.concatenate([s1,s2,s3], axis=0) # concatenamos con numopy pq al inicio lo hice con numpy. Luego con pandas, creamos un Dataframe
bigcolumn=pd.DataFrame(bigcolumn)
bigcolumn

         0
0        3
1        4
2        3
3        1
4        1
..     ...
295  22185
296  28107
297  19900
298  18082
299  17247

[300 rows x 1 columns]